#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-kZhjkktmXiAkCo6d

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_droplet.secondary: Refreshing state... [id=332539722]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
digitalocean_record.root: Refreshing state... [id=126395676]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # digitalocean_droplet.secondary has changed
  ~ resource "digitalocean_droplet" "secondary" {
        id                   = "332539722"
        name                 = "secondary"
      + tags                 = []
        # (22 unchanged attributes hidden)
    }

  # digitalocean_project.blackboards has changed
  ~ resource "digitalocean_project" "blackboards" {
        id          = "d006b183-c896-4d41-a341-fb46d729eeb6"
        name        = "blackboards"
      ~ resources   = [
          + "do:droplet:332539722",
            # (3 unchanged elements hidden)
        ]
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.secondary must be replaced
-/+ resource "digitalocean_droplet" "secondary" {
      ~ created_at           = "2022-12-23T07:53:39Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "332539722" -> (known after apply)
      ~ ipv4_address         = "139.59.168.247" -> (known after apply)
      ~ ipv4_address_private = "10.131.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "secondary"
      ~ price_hourly         = 0.00893 -> (known after apply)
      ~ price_monthly        = 6 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      + ssh_keys             = [
          + "23928565",
        ] # forces replacement
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:332539722" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "a1c4e609-4bda-4513-a0c4-230fbfcfdd3d" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_project.blackboards will be updated in-place
  ~ resource "digitalocean_project" "blackboards" {
        id          = "d006b183-c896-4d41-a341-fb46d729eeb6"
        name        = "blackboards"
      ~ resources   = [
          - "do:droplet:332539722",
            # (3 unchanged elements hidden)
        ]
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```

</details>